artillery-sio.yml
# Artillery v2 Socket.IO test for Planning Poker app
# Target: production instance
# Usage examples:
#   - Participants only (join existing room):
#       ROOM_ID=ABC123 artillery run artillery-sio.yml
#   - Scrum master flow (creates rooms):
#       artillery run --scenarios=scum_master_flow artillery-sio.yml
#     (Note: SM-flow does not share roomId across VUs; treat it as an e2e smoke test.)

config:
  target: "http://localhost"

  # Load phases - adjust to your needs
  phases:
    - duration: 60   # warmup 1 min
      arrivalRate: 5
      name: warmup
    - duration: 300  # 5 min ramp-up
      arrivalRate: 20
      rampTo: 100
      name: ramp
    - duration: 300  # 5 min sustained load
      arrivalRate: 100
      name: sustain

  engines:
    socketio: {}

  socketio:
    transports: ["websocket"]
    path: "/socket.io"
    # secure: true # inferred from https target

  ensure:
    maxErrorRate: 1 # accept up to 1% errors

  variables:
    # Set via environment: ROOM_ID=ABC123 artillery run artillery-sio.yml
    ROOM_ID: "{{ $env.ROOM_ID || '' }}"

scenarios:
  # 1) Scrum Master scenario - full e2e flow for a single client
  - name: scrum_master_flow
    weight: 0 # set to >0 to enable in a mixed test
    engine: "socketio"
    flow:
      - emit:
          channel: "createRoom"
          data:
            userName: "SM-{{ $randomString() }}"
            initialStory: null
          acknowledge: true
          capture:
            - json: "$.roomId"
              as: "roomId"
            - json: "$.user.id"
              as: "smUserId"
      - think: 1
      - emit:
          channel: "startVoting"
          data:
            roomId: "{{ roomId }}"
            story:
              title: "Story {{ $randomString() }}"
              description: "Test load"
      - think: 1
      - emit:
          channel: "submitVote"
          data:
            roomId: "{{ roomId }}"
            userId: "{{ smUserId }}"
            value: "5"
      - think: 1
      - emit:
          channel: "revealResults"
          data:
            roomId: "{{ roomId }}"
      - think: 1
      - emit:
          channel: "resetVoting"
          data:
            roomId: "{{ roomId }}"

  # 2) Participant scenario - join the given room and cast a vote
  - name: participant_flow
    weight: 1 # main load scenario - increase if using a mix
    engine: "socketio"
    flow:
      # Note: ROOM_ID is REQUIRED (e.g. ROOM_ID=ABC123)
      - think: 0.5
      - emit:
          channel: "joinRoom"
          data:
            roomId: "{{ ROOM_ID }}"
            userName: "U-{{ $randomString() }}"
          acknowledge: true
          capture:
            - json: "$.user.id"
              as: "userId"
      - think: 1
      - emit:
          channel: "submitVote"
          data:
            roomId: "{{ ROOM_ID }}"
            userId: "{{ userId }}"
            value: "5"
      - think: 3
      # Leave the client connected - simulates presence in the session